app/services/order_placing_service.rb

	def place_order!
		@order.build_item_cache_from_cart(@cart)
		@order.calculate_total!(@cart)
		@order.update_columns(seller_id: @order.items.first.seller.id)
---
UPDATE "orders" SET "seller_id" = 1 WHERE "orders"."id" = 3