app/views/stores/show.html.erb

SELECT "products".* FROM "products"  WHERE "products"."store_id" = $1
---

<% @store.products.each do |product| %>