app/api/api/v1/products.rb

SELECT  "products".* FROM "products"  WHERE "products"."id" = $1 LIMIT 1
---
      resources :products do
        desc "Get Specific Product"
        get "/:id" do
          @product = Product.find(params[:id])