app/api/api/v1/stores.rb

SELECT  "stores".* FROM "stores"  WHERE "stores"."id" = $1 LIMIT 1
SELECT "products".* FROM "products"  WHERE "products"."store_id" = $1  ORDER BY "products"."id" DESC
---

        desc "Get Prodects In Specific Store"
        get "/:id/products" do
          store = Store.find(params[:id])
          @products = store.products.order(id: :desc)