app/controllers/application_controller.rb

SELECT  "carts".* FROM "carts"  WHERE "carts"."id" = 3 LIMIT 1
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"
---
  def find_cart
  	cart = Cart.find_by(:id => session[:cart_id])

  	unless cart.present?
  		cart = Cart.create