app/controllers/stores_controller.rb

SELECT  "stores".* FROM "stores"  WHERE "stores"."approved" = 't' AND "stores"."id" = $1 LIMIT 1
---
  def show
    @store = Store.approved.find(params[:id])