app/models/cart.rb

SELECT "cart_items".* FROM "cart_items"  WHERE "cart_items"."cart_id" = $1
---
	def cart_items_quantity_is_legal?
		self.cart_items.each do |cart_item|