app/models/order.rb

	def build_item_cache_from_cart(cart)
		cart.cart_items.each do |cart_item|
---
SELECT "cart_items".* FROM "cart_items"  WHERE "cart_items"."cart_id" = $1

	def calculate_total!(current_cart)
		self.total = current_cart.total_price
		self.save
---
UPDATE "orders" SET "total" = $1, "updated_at" = $2 WHERE "orders"."id" = 3